package tasksNumber32.taskC;

/*
        **Задача C. Вопросы и Ответы**

        Ответьте на вопросы **своими словами**:

        1. Что вам непонятно в массивах?
            В массивах всё понятно
        1. Какие минусы есть у ArrayList?
            Думаю плюс, а также минус дублирование, удаление старого массива и увелечение нового массива 1.5 раза.
        1. Объясните структуру LinkedList?
            Получение объектов с двух старон с конца и в начале(двухсвязный список)
        1. В чем отличие между ArrayList и LinkedList?
            ArrayList - это список на основе массива. LinkedList - это просто связной список.
        1. Какие плюсы и минусы есть при работе с LinkedList?
            плюсы: вставка, удаление, поиск если с конца.
            минусы: при добавление элемента она с начала разойдиняет
            два объекта и добавляет новый объект и потом обратно с крещивает.
 */

