package tasksNumber35.taskC;

/*
        Задача C. Вопросы и Ответы

        Ответьте на вопросы своими словами:

        1. Как вы понимаете массивы?
            Массив - структура данных, которая хранит однотипные данные
        2. Как вы понимаете ArrayList?
            ArrayList - это одна из реализаций интерфейса List(список) за основу которой берётся обычный массив
        3. В чем отличия между обычным массивом и ArrayList?
            Массив может содержать как примитивные типы данных, так и объекты. Но ArrayList не может содержать примитивные типы данных. Он содержит только объекты.
        4. Как вы понимаете Wrapper классы и для чего они нужны?
            Wrapper классы нужны для работы с листами. пример: int - Integer.
        5. Чем отличаются методы set(a, b) и add(a, b) у ArrayList?
            Add добавляет в лист, а set затирает предыдущее значение
 */